In [3]:
import pandas as pd

In [11]:
s1=pd.Series(['A','B','C'],index=[1,2,3])

In [10]:

s2=pd.Series(['D','E','F'],index=[4,5,6])

In [14]:
pd.concat([s1,s2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [26]:
df1={ "Name": ["Braund, Mr. Owen Harris","Allen, Mr. William Henry","Bonnell, Miss. Elizabeth"],
 "Age": [22, 35, 58],
 "Gender": ["male", "male", "female"]
}
df1

{'Name': ['Braund, Mr. Owen Harris',
  'Allen, Mr. William Henry',
  'Bonnell, Miss. Elizabeth'],
 'Age': [22, 35, 58],
 'Gender': ['male', 'male', 'female']}

In [27]:
df2={ "Name": ["Ravi","Mr Henry","Elizabeth"],
 "Age": [24, 31, 68],
 "Gender": ["male", "male", "female"]
}
df2 = pd.DataFrame()

{'Name': ['Ravi', 'Mr Henry', 'Elizabeth'],
 'Age': [24, 31, 68],
 'Gender': ['male', 'male', 'female']}

TypeError: cannot concatenate object of type '<class 'dict'>'; only Series and DataFrame objs are valid

In [32]:
df1 = pd.DataFrame({'id': ['A01', 'A02', 'A03', 'A04'],
                    'Name': ['ABC', 'PQR', 'DEF', 'GHI']})
df1

    id Name
0  A01  ABC
1  A02  PQR
2  A03  DEF
3  A04  GHI

In [33]:
df2 = pd.DataFrame({'id': ['A01', 'A02', 'A03', 'A04'],
                    'Name': ['ABC', 'PQR', 'DEF', 'GHI']})
df2

    id Name
0  A01  ABC
1  A02  PQR
2  A03  DEF
3  A04  GHI

In [35]:
pd.concat([df1,df2],axis = 1)

    id Name   id Name
0  A01  ABC  A01  ABC
1  A02  PQR  A02  PQR
2  A03  DEF  A03  DEF
3  A04  GHI  A04  GHI

In [36]:
pd.concat([df1,df2],ignore_index=True)

    id Name
0  A01  ABC
1  A02  PQR
2  A03  DEF
3  A04  GHI
4  A01  ABC
5  A02  PQR
6  A03  DEF
7  A04  GHI

In [37]:
pd.concat([df1,df2],verify_integrity=True)

ValueError: Indexes have overlapping values: Index([0, 1, 2, 3], dtype='int64')

In [39]:
pd.concat([df1,df2], keys =['x','y'])

      id Name
x 0  A01  ABC
  1  A02  PQR
  2  A03  DEF
  3  A04  GHI
y 0  A01  ABC
  1  A02  PQR
  2  A03  DEF
  3  A04  GHI

In [45]:
import pandas as pd
# First DataFrame
df1 = pd.DataFrame({'id': ['A01', 'A02', 'A03', 'A04'],
					'Name': ['ABC', 'PQR', 'DEF', 'GHI']})

# Second DataFrame
df2 = pd.DataFrame({'id': ['B05', 'B06', 'B07', 'B08'],
					'Name': ['XYZ', 'TUV', 'MNO', 'JKL']})

In [46]:
pd.concat([df1,df2], join='inner')

    id Name
0  A01  ABC
1  A02  PQR
2  A03  DEF
3  A04  GHI
0  B05  XYZ
1  B06  TUV
2  B07  MNO
3  B08  JKL

In [47]:
pd.concat([df1,df2], join='outer')

    id Name
0  A01  ABC
1  A02  PQR
2  A03  DEF
3  A04  GHI
0  B05  XYZ
1  B06  TUV
2  B07  MNO
3  B08  JKL

In [49]:
import pandas as pd

# Sample dataset
data = {
    'Name': ['John Doe', 'Jane Doe', 'Mary Johnson', 'Mike Brown', 'Lisa Smith'],
    'Age': [28, 34, 45, 23, 38],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'Occupation': ['Software Engineer', 'Data Scientist', 'Doctor', 'Lawyer', 'Architect']
}

# Create a DataFrame
df = pd.DataFrame(data)

df

           Name  Age         City         Occupation
0      John Doe   28     New York  Software Engineer
1      Jane Doe   34  Los Angeles     Data Scientist
2  Mary Johnson   45      Chicago             Doctor
3    Mike Brown   23      Houston             Lawyer
4    Lisa Smith   38      Phoenix          Architect

In [44]:
# Additional DataFrame and Series for concatenation examples
# df2 = pd.DataFrame({
#     'City': ['Seattle', 'Denver', 'Atlanta', 'Boston', 'Austin'],
#     'Occupation': ['Engineer', 'Teacher', 'Nurse', 'Chef', 'Pilot']
# })

# email_series = pd.Series(['john.doe@example.com', 'jane.doe@example.com', 'mary.j@example.com', 'mike.b@example.com', 'lisa.s@example.com'], name='Email')

# # Concatenation examples
# # 1. Concatenating DataFrames vertically
# vertical_concat = pd.concat([df, df2], axis=0, ignore_index=True)

# # 2. Concatenating DataFrames horizontally
# horizontal_concat = pd.concat([df, df2], axis=1)

# # 3. Concatenating a DataFrame and a Series horizontally
# df_with_email = pd.concat([df, email_series], axis=1)

In [48]:
df2 = pd.DataFrame({
    'City': ['Seattle', 'Denver', 'Atlanta', 'Boston', 'Austin'],
    'Occupation': ['Engineer', 'Teacher', 'Nurse', 'Chef', 'Pilot']
})

In [51]:
pd.concat([df,df2],axis =1)

           Name  Age         City         Occupation     City Occupation
0      John Doe   28     New York  Software Engineer  Seattle   Engineer
1      Jane Doe   34  Los Angeles     Data Scientist   Denver    Teacher
2  Mary Johnson   45      Chicago             Doctor  Atlanta      Nurse
3    Mike Brown   23      Houston             Lawyer   Boston       Chef
4    Lisa Smith   38      Phoenix          Architect   Austin      Pilot

In [53]:
pd.concat([df,df2],axis =0)
email_series = pd.Series(['john.doe@example.com', 'jane.doe@example.com', 'mary.j@example.com', 'mike.b@example.com', 'lisa.s@example.com'], name='Email')

In [55]:
pd.concat([df,email_series],axis =1)

           Name  Age         City         Occupation                 Email
0      John Doe   28     New York  Software Engineer  john.doe@example.com
1      Jane Doe   34  Los Angeles     Data Scientist  jane.doe@example.com
2  Mary Johnson   45      Chicago             Doctor    mary.j@example.com
3    Mike Brown   23      Houston             Lawyer    mike.b@example.com
4    Lisa Smith   38      Phoenix          Architect    lisa.s@example.com

In [58]:
books_df = pd.DataFrame({
    'Title': ['To Kill a Mockingbird', '1984', 'The Great Gatsby'],
    'Author': ['Harper Lee', 'George Orwell', 'F. Scott Fitzgerald']
})
books_df

                   Title               Author
0  To Kill a Mockingbird           Harper Lee
1                   1984        George Orwell
2       The Great Gatsby  F. Scott Fitzgerald

In [57]:
new_book_1 = {'Title': 'The Catcher in the Rye', 'Author': 'J.D. Salinger'}
new_book_2 = {'Title': 'The Hobbit', 'Author': 'J.R.R. Tolkien'}

In [60]:
new_book_1

{'Title': 'The Catcher in the Rye', 'Author': 'J.D. Salinger'}

In [61]:
updated_books_df = books_df.append([new_book_1, new_book_2], ignore_index=True)

AttributeError: 'DataFrame' object has no attribute 'append'

In [76]:
books_df = pd.DataFrame({
    'Title': ['To Kill a Mockingbird', '1984', 'The Great Gatsby'],
    'Author': ['Harper Lee', 'George Orwell', 'F. Scott Fitzgerald']
})

In [77]:
new_book_1 = {'Title': 'The Catcher in the Rye', 'Author': 'J.D. Salinger'}
new_book_2 = {'Title': 'The Hobbit', 'Author': 'J.R.R. Tolkien'}

In [78]:
updated_books_df = books_df.append([new_book_1, new_book_2], ignore_index=True)

updated_books_df

AttributeError: 'DataFrame' object has no attribute 'append'

In [79]:
pd.__version__

'2.0.3'

In [80]:
# Sample DataFrame 1: Users
users_df = pd.DataFrame({
    'UserID': [1, 2, 3],
    'UserName': ['Alice', 'Bob', 'Charlie']
})

# Sample DataFrame 2: Emails
emails_df = pd.DataFrame({
    'UserID': [2, 3, 1],
    'Email': ['bob@example.com', 'charlie@example.com', 'alice@example.com']
})

# Perform a one-to-one join on UserID
one_to_one_joined_df = pd.merge(users_df, emails_df)

one_to_one_joined_df

   UserID UserName                Email
0       1    Alice    alice@example.com
1       2      Bob      bob@example.com
2       3  Charlie  charlie@example.com

In [81]:
orders_df = pd.DataFrame({
    'OrderID': [101, 102, 103, 104],
    'UserID': [1, 2, 1, 3],  # Note the duplicate UserID values
    'OrderDetail': ['Book', 'Laptop', 'Pen', 'Notebook']
})

In [82]:
users_df = pd.DataFrame({
    'UserID': [1, 2, 3],
    'UserName': ['Alice', 'Bob', 'Charlie']
})

In [83]:
many_to_one_joined_df = pd.merge(orders_df, users_df)

many_to_one_joined_df

   OrderID  UserID OrderDetail UserName
0      101       1        Book    Alice
1      103       1         Pen    Alice
2      102       2      Laptop      Bob
3      104       3    Notebook  Charlie

In [84]:
user_projects_df = pd.DataFrame({
    'UserID': [1, 2, 1, 3, 2],
    'ProjectID': ['A', 'A', 'B', 'B', 'C']  # Note: Projects A and B involve multiple users
})

In [85]:
project_details_df = pd.DataFrame({
    'ProjectID': ['A', 'A', 'B', 'C', 'C'],
    'Detail': ['Phase 1', 'Phase 2', 'Initial', 'Planning', 'Execution']  # Note: Projects A and C have multiple phases/details
})

In [87]:
many_to_many_joined_df = pd.merge(user_projects_df, project_details_df, on='ProjectID', how='inner')

many_to_many_joined_df

   UserID ProjectID     Detail
0       1         A    Phase 1
1       1         A    Phase 2
2       2         A    Phase 1
3       2         A    Phase 2
4       1         B    Initial
5       3         B    Initial
6       2         C   Planning
7       2         C  Execution

In [88]:
# Sample DataFrame 1: Users
users_df = pd.DataFrame({
    'UserID': [1, 2, 3],
    'UserName': ['Alice', 'Bob', 'Charlie']
})

# Sample DataFrame 2: Emails
emails_df = pd.DataFrame({
    'UserID': [2, 3, 1],
    'Email': ['bob@example.com', 'charlie@example.com', 'alice@example.com']
})

# Perform a one-to-one join on UserID
one_to_one_joined_df = pd.merge(users_df, emails_df, on='UserID')

one_to_one_joined_df

   UserID UserName                Email
0       1    Alice    alice@example.com
1       2      Bob      bob@example.com
2       3  Charlie  charlie@example.com